Microchip-MPLAB-Harmony/wireless_apps_pic32cxbz3_wbz35/apps/ble/advanced_applications/ble_sensor_touch/firmware/src/packs/WBZ351_DFP/component/dmt.h
/*
 * Component description for DMT
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-02-01T05:15:15Z */
#ifndef _WBZ35_DMT_COMPONENT_H_
#define _WBZ35_DMT_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR DMT                                          */
/* ************************************************************************** */

/* -------- DMT_DMTCON : (DMT Offset: 0x00) (R/W 32)  -------- */
#define DMT_DMTCON_RESETVALUE                 _UINT32_(0x00)                                       /*  (DMT_DMTCON)   Reset Value */

#define DMT_DMTCON_ON_Pos                     _UINT32_(15)                                         /* (DMT_DMTCON)  Position */
#define DMT_DMTCON_ON_Msk                     (_UINT32_(0x1) << DMT_DMTCON_ON_Pos)                 /* (DMT_DMTCON)  Mask */
#define DMT_DMTCON_ON(value)                  (DMT_DMTCON_ON_Msk & (_UINT32_(value) << DMT_DMTCON_ON_Pos)) /* Assigment of value for ON in the DMT_DMTCON register */
#define DMT_DMTCON_Msk                        _UINT32_(0x00008000)                                 /* (DMT_DMTCON) Register Mask  */


/* -------- DMT_DMTCONCLR : (DMT Offset: 0x04) (R/W 32) Bit clear register -------- */
#define DMT_DMTCONCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (DMT_DMTCONCLR) Bit clear register  Reset Value */

#define DMT_DMTCONCLR_Msk                     _UINT32_(0x00000000)                                 /* (DMT_DMTCONCLR) Register Mask  */


/* -------- DMT_DMTCONSET : (DMT Offset: 0x08) (R/W 32) Bit set register -------- */
#define DMT_DMTCONSET_RESETVALUE              _UINT32_(0x00)                                       /*  (DMT_DMTCONSET) Bit set register  Reset Value */

#define DMT_DMTCONSET_Msk                     _UINT32_(0x00000000)                                 /* (DMT_DMTCONSET) Register Mask  */


/* -------- DMT_DMTCONINV : (DMT Offset: 0x0C) (R/W 32) Bit invert register -------- */
#define DMT_DMTCONINV_RESETVALUE              _UINT32_(0x00)                                       /*  (DMT_DMTCONINV) Bit invert register  Reset Value */

#define DMT_DMTCONINV_Msk                     _UINT32_(0x00000000)                                 /* (DMT_DMTCONINV) Register Mask  */


/* -------- DMT_DMTPRECLR : (DMT Offset: 0x10) (R/W 32)  -------- */
#define DMT_DMTPRECLR_RESETVALUE              _UINT32_(0x00)                                       /*  (DMT_DMTPRECLR)   Reset Value */

#define DMT_DMTPRECLR_STEP1_Pos               _UINT32_(8)                                          /* (DMT_DMTPRECLR)  Position */
#define DMT_DMTPRECLR_STEP1_Msk               (_UINT32_(0xFF) << DMT_DMTPRECLR_STEP1_Pos)          /* (DMT_DMTPRECLR)  Mask */
#define DMT_DMTPRECLR_STEP1(value)            (DMT_DMTPRECLR_STEP1_Msk & (_UINT32_(value) << DMT_DMTPRECLR_STEP1_Pos)) /* Assigment of value for STEP1 in the DMT_DMTPRECLR register */
#define DMT_DMTPRECLR_Msk                     _UINT32_(0x0000FF00)                                 /* (DMT_DMTPRECLR) Register Mask  */


/* -------- DMT_DMTPRECLRCLR : (DMT Offset: 0x14) (R/W 32) Bit clear register -------- */
#define DMT_DMTPRECLRCLR_RESETVALUE           _UINT32_(0x00)                                       /*  (DMT_DMTPRECLRCLR) Bit clear register  Reset Value */

#define DMT_DMTPRECLRCLR_Msk                  _UINT32_(0x00000000)                                 /* (DMT_DMTPRECLRCLR) Register Mask  */


/* -------- DMT_DMTPRECLRSET : (DMT Offset: 0x18) (R/W 32) Bit set register -------- */
#define DMT_DMTPRECLRSET_RESETVALUE           _UINT32_(0x00)                                       /*  (DMT_DMTPRECLRSET) Bit set register  Reset Value */

#define DMT_DMTPRECLRSET_Msk                  _UINT32_(0x00000000)                                 /* (DMT_DMTPRECLRSET) Register Mask  */


/* -------- DMT_DMTPRECLRINV : (DMT Offset: 0x1C) (R/W 32) Bit invert register -------- */
#define DMT_DMTPRECLRINV_RESETVALUE           _UINT32_(0x00)                                       /*  (DMT_DMTPRECLRINV) Bit invert register  Reset Value */

#define DMT_DMTPRECLRINV_Msk                  _UINT32_(0x00000000)                                 /* (DMT_DMTPRECLRINV) Register Mask  */


/* -------- DMT_DMTCLR : (DMT Offset: 0x20) (R/W 32)  -------- */
#define DMT_DMTCLR_RESETVALUE                 _UINT32_(0x00)                                       /*  (DMT_DMTCLR)   Reset Value */

#define DMT_DMTCLR_STEP2_Pos                  _UINT32_(0)                                          /* (DMT_DMTCLR)  Position */
#define DMT_DMTCLR_STEP2_Msk                  (_UINT32_(0xFF) << DMT_DMTCLR_STEP2_Pos)             /* (DMT_DMTCLR)  Mask */
#define DMT_DMTCLR_STEP2(value)               (DMT_DMTCLR_STEP2_Msk & (_UINT32_(value) << DMT_DMTCLR_STEP2_Pos)) /* Assigment of value for STEP2 in the DMT_DMTCLR register */
#define DMT_DMTCLR_Msk                        _UINT32_(0x000000FF)                                 /* (DMT_DMTCLR) Register Mask  */


/* -------- DMT_DMTCLRCLR : (DMT Offset: 0x24) (R/W 32) Bit clear register -------- */
#define DMT_DMTCLRCLR_RESETVALUE              _UINT32_(0x00)                                       /*  (DMT_DMTCLRCLR) Bit clear register  Reset Value */

#define DMT_DMTCLRCLR_Msk                     _UINT32_(0x00000000)                                 /* (DMT_DMTCLRCLR) Register Mask  */


